# CreateMapped Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PathOfTravel..::..CreateMapped Method
PathOfTravel Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CreateMapped(View, IList<(Of <<'(XYZ>)>>), IList<(Of <<'(XYZ>)>>)) | Creates multiple new paths of travel by mapping each of a set of start points to each of a set of end points. |
| CreateMapped(View, IList<(Of <<'(XYZ>)>>), IList<(Of <<'(XYZ>)>>), IList<(Of <<'(PathOfTravelCalculationStatus>)>>)%) | Creates multiple new paths of travel by mapping each of a set of start points to each of a set of end points and provides creation result statuses. |

# See Also
PathOfTravel Class
PathOfTravel Members
Autodesk.Revit.DB.Analysis Namespace